chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/app/Harmony_Sys.c
};

/*******************************************
 * Array of Full speed config descriptors
 *******************************************/
USB_DEVICE_CONFIGURATION_DESCRIPTORS_TABLE fullSpeedConfigDescSet[1] ={
    fullSpeedConfigurationDescriptor
};


/**************************************
 *  String descriptors.
 *************************************/

/*******************************************
 *  Language code string descriptor
 *******************************************/
const struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type 
    uint16_t string[1]; // String
}

sd000 ={
    0, // Index of this string is 0
    0, // This field is always blank for String Index 0
    sizeof (sd000) - sizeof (sd000.stringIndex) - sizeof (sd000.languageID),
    USB_DESCRIPTOR_STRING,
    {
        0x0409} // Language ID
};

/*******************************************
 *  Manufacturer string descriptor
 *******************************************/
const struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type
    uint16_t string[7]; // String
}

sd001 ={
    1, // Index of this string descriptor is 1. 
    0x0409, // Language ID of this string descriptor is 0x0409 (English)
    sizeof (sd001) - sizeof (sd001.stringIndex) - sizeof (sd001.languageID),
    USB_DESCRIPTOR_STRING,
    {
        'c', 'h', 'i', 'p', 'K', 'I', 'T'}
};

/*******************************************
 *  Product string descriptor
 *******************************************/
const struct __attribute__((packed))
{
    uint8_t stringIndex; //Index of the string descriptor
    uint16_t languageID; // Language ID of this string.
    uint8_t bLength; // Size of this descriptor in bytes
    uint8_t bDscType; // STRING descriptor type 
    uint16_t string[23]; // String
}

sd002 ={
    2, // Index of this string descriptor is 2. 
    0x0409, // Language ID of this string descriptor is 0x0409 (English)
    sizeof (sd002) - sizeof (sd002.stringIndex) - sizeof (sd002.languageID),
    USB_DESCRIPTOR_STRING,
    {
        'M', 'P', 'I', 'D', 'E', ' ', 'C', 'o', 'm', 'p', 'a', 't', 'i', 'b', 'l', 'e', ' ', 'D', 'e', 'v', 'i', 'c', 'e'}
};

/***************************************
 * Array of string descriptors
 ***************************************/
USB_DEVICE_STRING_DESCRIPTORS_TABLE stringDescriptors[3] ={
    (const uint8_t * const) &sd000,
    (const uint8_t * const) &sd001,
    (const uint8_t * const) &sd002
};


/*******************************************
 * USB Device Layer Master Descriptor Table 
 *******************************************/
const USB_DEVICE_MASTER_DESCRIPTOR usbMasterDescriptor ={
    &deviceDescriptor, /* Full speed descriptor */
    1, /* Total number of full speed configurations available */
    fullSpeedConfigDescSet, /* Pointer to array of full speed configurations descriptors*/
    NULL,
    0,
    NULL,
    3, // Total number of string descriptors available.
    stringDescriptors, // Pointer to array of string descriptors.
	NULL,	// full speed device qualifier
    NULL
};


/****************************************************
 * USB Device Layer Initialization Data
 ****************************************************/
const USB_DEVICE_INIT usbDevInitData ={
    /* System module initialization */
    .moduleInit =
    {SYS_MODULE_POWER_RUN_FULL},

    /* Number of function drivers registered to this instance of the
       USB device layer */
    .registeredFuncCount = 3,

    /* Function driver table registered to this instance of the USB device layer*/
    .registeredFunctions = (USB_DEVICE_FUNCTION_REGISTRATION_TABLE*) funcRegistrationTable,

    /* Pointer to USB Descriptor structure */
    .usbMasterDescriptor = (USB_DEVICE_MASTER_DESCRIPTOR*) & usbMasterDescriptor,

    /* USB Device Speed */
    .deviceSpeed = USB_SPEED_FULL,

#if defined(USB_DRV_HS)
	/* Index of the USB Driver to be used by this Device Layer Instance */
	.driverIndex = DRV_USBHS_INDEX,

	/* Pointer to the USB Driver Functions. */
	.usbDriverInterface = DRV_USBHS_DEVICE_INTERFACE,
#else
    /* Index of the USB Driver to be used by this Device Layer Instance */
	.driverIndex = DRV_USBFS_INDEX,

    /* Pointer to the USB Driver Functions. */
    .usbDriverInterface = DRV_USBFS_DEVICE_INTERFACE,
#endif
};

// </editor-fold>

// *****************************************************************************
// *****************************************************************************
// Section: Driver Initialization Data
// *****************************************************************************
// *****************************************************************************

//<editor-fold defaultstate="collapsed" desc="DRV_USB Initialization Data">

#if defined(USB_DRV_HS)

	/* USBHS Driver Initialization ********************/
	const DRV_USBHS_INIT drvUSBInit = {
		/* Interrupt Source for USB module */
		.interruptSource = DRV_USBHS_INTERRUPT_SOURCE,

		/* Interrupt Source for USB module */
		.interruptSourceUSBDma = INT_SOURCE_USB_1_DMA,

		/* System module initialization */
		.moduleInit = { SYS_MODULE_POWER_RUN_FULL },

		.operationMode = DRV_USBHS_OPMODE_DEVICE,

		.operationSpeed = USB_SPEED_FULL,

		/* Stop in idle */
		.stopInIdle = false,

		/* Suspend in sleep */
		.suspendInSleep = false,

		/* Identifies peripheral (PLIB-level) ID */
		.usbID = DRV_USBHS_PERIPHERAL_ID,
	};

#else

	/* USBFS Driver Initialization ********************/
	uint8_t __attribute__((aligned(512))) endPointTable[DRV_USBFS_ENDPOINTS_NUMBER * 32];
	const DRV_USBFS_INIT drvUSBInit ={
		/* Assign the endpoint table */
		.endpointTable = endPointTable,

		/* Interrupt Source for USB module */
		.interruptSource = DRV_USBFS_INTERRUPT_SOURCE,

