chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/app/Harmony_Sys.c
		/* System module initialization */
		.moduleInit =
		{SYS_MODULE_POWER_RUN_FULL},

		.operationMode = DRV_USBFS_OPMODE_DEVICE,

		.operationSpeed = USB_SPEED_FULL,

		/* Stop in idle */
		.stopInIdle = false,

		/* Suspend in sleep */
		.suspendInSleep = false,

		/* Identifies peripheral (PLIB-level) ID */
		.usbID = DRV_USBFS_PERIPHERAL_ID
	};

#endif
// </editor-fold>

#endif // _USB

// *****************************************************************************
// *****************************************************************************
// Section: System Data
// *****************************************************************************
// *****************************************************************************

/* Structure to hold the object handles for the modules in the system. */
HARMONY_SYSTEM_OBJECTS HarmonySysObj;


// *****************************************************************************
// *****************************************************************************
// Section: Module Initialization Data
// *****************************************************************************
// *****************************************************************************

/*******************************************************************************
  Device Control System Service Initialization Data
  
  <editor-fold defaultstate="collapsed" 
  desc="Device Control System Service Initialization Data">
 */

const SYS_DEVCON_INIT sysDevconInit ={
    .moduleInit =
    {0},
};

// </editor-fold>


// *****************************************************************************
// *****************************************************************************
// Section: Static Initialization Functions
// *****************************************************************************
// *****************************************************************************


// *****************************************************************************
// *****************************************************************************
// Section: System Initialization
// *****************************************************************************
// *****************************************************************************
void __attribute__((nomips16)) SYS_DEVCON_PerformanceConfig(unsigned int sysclk)
{
	bool int_flag = false;
	bool ecc;

	/* Set the PFM wait states based on the system clock and ECC setting */
	if (PLIB_PCACHE_ExistsWaitState(0))
	{
		int ws; /* number of wait states */

		/* Is ECC enabled? */
		/* TODO: replace register read with plib when available */
		ecc = (((CFGCON & 0x00000030) >> 4) < 2) ? true : false;
		if (sysclk <= (ecc ? 66000000 : 83000000))
			ws = 0;
		else if (sysclk <= (ecc ? 133000000 : 166000000))
			ws = 1;
		else
			ws = 2;

		/* Interrupts must be disabled when changing wait states */
		int_flag = (bool)(PLIB_INT_GetStateAndDisable(INT_ID_0) & 0x01);

		PLIB_PCACHE_WaitStateSet(0, ws);

		if (int_flag)
		{
			PLIB_INT_Enable(INT_ID_0);
			int_flag = false;
		}
	}

	/* Interrupts must be disabled when enabling the Prefetch Cache Module */
	int_flag = (bool)(PLIB_INT_GetStateAndDisable(INT_ID_0) & 0x01);

	/* Enable Prefetch Cache Module */
	if (PLIB_PCACHE_ExistsPrefetchEnable(0))
	{
		PLIB_PCACHE_PrefetchEnableSet(0, 0x03);
	}

	if (int_flag)
	{
		PLIB_INT_Enable(INT_ID_0);
	}
}

#define SYS_CLK_BUS_PERIPHERAL_1            100000000ul
#define SYS_CLK_BUS_PERIPHERAL_2            100000000ul
#define SYS_CLK_BUS_PERIPHERAL_3            100000000ul
#define SYS_CLK_BUS_PERIPHERAL_4            100000000ul
#define SYS_CLK_BUS_PERIPHERAL_5            100000000ul
#define SYS_CLK_BUS_PERIPHERAL_7            200000000ul
#define SYS_CLK_BUS_PERIPHERAL_8            100000000ul

void SYS_CLK_Initialize_TR(void)
{
	SYSKEY = 0x00000000;
	SYSKEY = 0xAA996655;
	SYSKEY = 0x556699AA;

	PLIB_OSC_FRCDivisorSelect(OSC_ID_0, OSC_FRC_DIV_1);

	/* Enable Peripheral Bus 1 */
	PLIB_OSC_PBClockDivisorSet(OSC_ID_0, 0, 2);
	PLIB_OSC_PBOutputClockEnable(OSC_ID_0, 0);
	/* Enable Peripheral Bus 2 */
	PLIB_OSC_PBClockDivisorSet(OSC_ID_0, 1, 2);
	PLIB_OSC_PBOutputClockEnable(OSC_ID_0, 1);
	/* Enable Peripheral Bus 3 */
	PLIB_OSC_PBClockDivisorSet(OSC_ID_0, 2, 2);
	PLIB_OSC_PBOutputClockEnable(OSC_ID_0, 2);
	/* Enable Peripheral Bus 4 */
	PLIB_OSC_PBClockDivisorSet(OSC_ID_0, 3, 2);
	PLIB_OSC_PBOutputClockEnable(OSC_ID_0, 3);
	/* Enable Peripheral Bus 5 */
	PLIB_OSC_PBClockDivisorSet(OSC_ID_0, 4, 2);
	PLIB_OSC_PBOutputClockEnable(OSC_ID_0, 4);
	/* Enable Peripheral Bus 7 */
	PLIB_OSC_PBClockDivisorSet(OSC_ID_0, 6, 1);
	PLIB_OSC_PBOutputClockEnable(OSC_ID_0, 6);
	/* Enable Peripheral Bus 8 */
	PLIB_OSC_PBClockDivisorSet(OSC_ID_0, 7, 2);
	PLIB_OSC_PBOutputClockEnable(OSC_ID_0, 7);

	SYSKEY = 0x33333333;
}
void Harmony_SYS_InitDrivers(void* data)
{
	//SYS_CLK_Initialize_TR();
	//SYS_DEVCON_PerformanceConfig(200000000ul);
	/* Initialize Drivers */

#if defined (_USB)
	#if defined(USB_DRV_HS)

		/* Initialize USB Driver */
		HarmonySysObj.drvUSBObject = DRV_USBHS_Initialize(DRV_USBHS_INDEX_0, (SYS_MODULE_INIT *)&drvUSBInit);
	#else
		/* Initialize USB Driver */
		HarmonySysObj.drvUSBObject = DRV_USBFS_Initialize(DRV_USBFS_INDEX_0, (SYS_MODULE_INIT *)&drvUSBInit);
	#endif
#endif
    
}

void Harmony_SYS_InitDevices(void* data)
{
    
#if defined (_USB)    
    /* Initialize the USB device layer */
    HarmonySysObj.usbDevObject0 = USB_DEVICE_Initialize(USB_DEVICE_INDEX_0, (SYS_MODULE_INIT*) & usbDevInitData);
#endif
    
}

void Harmony_SYS_InitApplication(void* data)
{
    Harmony_APP_Initialize();
}

// *****************************************************************************
// *****************************************************************************
// Section: System Interrupt Vector Functions
// *****************************************************************************
// *****************************************************************************

#if defined(_USB)

	#if defined(USB_DRV_HS)

		/* Implemented in wiring.c. Returns MS elapsed since power on. */
		extern unsigned long millis();

		/* Hacked time structure. */
		typedef struct _SYS_TIMER_OBJECT_HACK
		{
			uint32_t timerStartTime;
			uint32_t timerPeriod;
		}SYS_TIMER_OBJECT_HACK;

		/* Hacked timer instance.  One is all that is needed for USBHS driver. */
		static SYS_TIMER_OBJECT_HACK mTimerObjectHack = { 0, 0 };

		/* Hacked harmony timer function. We include headers but not the harmony source files for sys_tmr.c and drv_tmr.c */
		SYS_TMR_HANDLE SYS_TMR_DelayMS(uint32_t delayMs)
		{
			mTimerObjectHack.timerStartTime = millis();
			mTimerObjectHack.timerPeriod = delayMs;

			return (SYS_TMR_HANDLE)&mTimerObjectHack;
		}

		/* Hacked harmony timer function. We include headers but not the harmony source files for sys_tmr.c and drv_tmr.c */
		bool SYS_TMR_DelayStatusGet(SYS_TMR_HANDLE handle)
		{
			return ((millis() - ((SYS_TIMER_OBJECT_HACK*)handle)->timerStartTime) >= ((SYS_TIMER_OBJECT_HACK*)handle)->timerPeriod);
		}

		void Harmony_Service_USB(void)
		{
			DRV_USBHS_Tasks_ISR(HarmonySysObj.drvUSBObject);
		}
		void Harmony_Service_USBDMA(void)
		{
			DRV_USBHS_Tasks_ISR_USBDMA(HarmonySysObj.drvUSBObject);
		}
		/*
		void __ISR(_USB_VECTOR, ipl6AUTO) _IntHandlerUSBInstance0(void)
		{

			DRV_USBHS_Tasks_ISR(HarmonySysObj.drvUSBObject);

		}
		void __ISR(_USB_DMA_VECTOR, ipl6AUTO) _IntHandlerUSBInstance0_USBDMA(void)
		{

			DRV_USBHS_Tasks_ISR_USBDMA(HarmonySysObj.drvUSBObject);

		}
		*/




	#else

		void __attribute__((vector(_USB_1_VECTOR), interrupt(ipl6SOFT), nomips16)) _IntHandlerUSBInstance0(void)
		{
			gUsbIntCount++;
			DRV_USBFS_Tasks_ISR(HarmonySysObj.drvUSBObject);
		}

	#endif

#endif

void Harmony_SYS_Tasks(void)
{
    /* Maintain system services */
    //    SYS_DEVCON_Tasks(HarmonySysObj.sysDevcon);

    /* Maintain Device Drivers */

    /* Maintain Middleware & Other Libraries */

#if defined(_USB)

	#if defined(USB_DRV_HS)
		/* USB FS Driver Task Routine */
		DRV_USBHS_Tasks(HarmonySysObj.drvUSBObject);
	#else
		/* USB FS Driver Task Routine */
		DRV_USBFS_Tasks(HarmonySysObj.drvUSBObject);
	#endif

    /* USB Device layer tasks routine */
    USB_DEVICE_Tasks(HarmonySysObj.usbDevObject0);

#endif
    
    /* Maintain the application's state machine. */
    Harmony_APP_Tasks();
}

/*******************************************************************************
 End of File
 */

